# identity-shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database.cockroach_database.default will be created
  + resource "cockroach_database" "default" {
      + cluster_id  = (sensitive value)
      + id          = (known after apply)
      + name        = "identity"
      + table_count = (known after apply)
    }

  # module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "cluster_id" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "cockroachdb_serverless_cluster_id"
      + type    = (known after apply)
      + value   = (sensitive value)
      + version = (known after apply)
    }

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "identity_database_migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "identity_database_migration"
      + password   = (sensitive value)
    }

  # module.common_resources.module.database_migration_user.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "random_seed" = "a30afaa6-0d47-408d-917a-3c698ecd4913"
        }
      + length           = 64
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.common_resources.module.kafka_topic.upstash_kafka_topic.default will be created
  + resource "upstash_kafka_topic" "default" {
      + cleanup_policy   = "delete"
      + cluster_id       = (sensitive value)
      + creation_time    = (known after apply)
      + id               = (known after apply)
      + max_message_size = 1048576
      + multizone        = (known after apply)
      + partitions       = 3
      + password         = (sensitive value)
      + region           = (known after apply)
      + rest_endpoint    = (known after apply)
      + retention_size   = 1073741824
      + retention_time   = 259200000
      + state            = (known after apply)
      + tcp_endpoint     = (known after apply)
      + topic_id         = (known after apply)
      + topic_name       = "identity.v1"
      + username         = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*